{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "function_type": "lambda", "name": "lambda_1", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0089\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "batch_input_shape": [null, 66, 200, 3], "output_shape": null, "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "b_constraint": null, "name": "convolution2d_1", "bias": true, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "init": "glorot_uniform", "nb_filter": 24, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "b_constraint": null, "name": "convolution2d_2", "bias": true, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "init": "glorot_uniform", "nb_filter": 36, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_col": 5, "b_constraint": null, "name": "convolution2d_3", "bias": true, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "init": "glorot_uniform", "nb_filter": 48, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "b_constraint": null, "name": "convolution2d_4", "bias": true, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "init": "glorot_uniform", "nb_filter": 64, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "b_constraint": null, "name": "convolution2d_5", "bias": true, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "init": "glorot_uniform", "nb_filter": 64, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "input_dim": 1152, "trainable": true, "output_dim": 1164, "b_constraint": null, "name": "dense_1", "bias": true, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "input_dim": 1164, "trainable": true, "output_dim": 100, "b_constraint": null, "name": "dense_2", "bias": true, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "input_dim": 100, "trainable": true, "output_dim": 50, "b_constraint": null, "name": "dense_3", "bias": true, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "input_dim": 50, "trainable": true, "output_dim": 10, "b_constraint": null, "name": "dense_4", "bias": true, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "input_dim": 10, "trainable": true, "output_dim": 1, "b_constraint": null, "name": "dense_5", "bias": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null}}]}